app/views/mixtapes/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "user_mixtapes" ON "users"."id" = "user_mixtapes"."user_id" WHERE "user_mixtapes"."mixtape_id" = ?  [["mixtape_id", 1]]
---
<ul>
  <% @mixtape.users.each do |user| %>