app/controllers/mixtapes/users_controller.rb

SELECT "mixtapes".* FROM "mixtapes" WHERE "mixtapes"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" INNER JOIN "user_mixtapes" ON "users"."id" = "user_mixtapes"."user_id" WHERE "user_mixtapes"."mixtape_id" = ?  [["mixtape_id", 1]]
---
  def new
    @mixtape = Mixtape.find(params[:mixtape_id])
    @mixtape_user = UserMixtape.new
    @users = User.all - @mixtape.users

INSERT INTO "user_mixtapes" ("created_at", "mixtape_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Wed, 13 Nov 2013 19:01:52 UTC +00:00], ["mixtape_id", 1], ["updated_at", Wed, 13 Nov 2013 19:01:52 UTC +00:00], ["user_id", 5]]
---
  def create
    UserMixtape.create(user_mixtape_params)